app/controllers/address2s_controller.rb

  def index
    @address2s = Address2.all
---
SELECT "address2s".* FROM "address2s"

  def show
    @address2 = Address2.find(params[:id])
---
SELECT "address2s".* FROM "address2s" WHERE "address2s"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @address2 = Address2.new(params[:address2])

    respond_to do |format|
      if @address2.save
---
INSERT INTO "address2s" ("created_at", "email", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sat, 22 Dec 2012 08:41:24 UTC +00:00], ["email", "a1125ts@aiit.ac.jp"], ["name", "tshibata"], ["updated_at", Sat, 22 Dec 2012 08:41:24 UTC +00:00]]